Repository: foytingo/fueler
Catalog: lib/l10n/app_*.arb
Languages: tr

# language
source: English
tr: Turkish

# fuelerTitle
source: Track your fuel expenses.
tr: Yakıt alışverişlerinizi takip edin

source: Continue with Apple
tr: Apple ile devam edin

source: Continue with Google
tr: Google ile devam edin

source: or
tr: ya da

source: Create Account
tr: Hesap oluştur

# haveAnAccount
source: Have an account already? Login
tr: Hesabın var mı? Giriş yap

source: Apple Login Error
tr: Apple ile devam hatası

source: Google Login Error
tr: Google ile devam hatası

source: Ok
tr: Tamam

source: Fuels
tr: Yakıtlar

# fuelsDeleteWithSuccess
source: Fuel expense was successfully deleted.
tr: Yakıt gideri başarıyla silindi.

# fuelsDeleteWithError
source: Fuel expense could not be deleted. Try again later.
tr: Yakıt gideri silinemedi. Daha sonra tekrar deneyin.

# emptyFuelList
source: There is no fuel expenses here. You can add with 'Add Fuel' button down below.
tr: Hiç yakıt alışverişi yok. Aşağıdaki 'Yakıt Ekle' butonu ile ekleyebilirsiniz.

# fuelsAddWithSuccess
source: Fuel expense was successfully added.
tr: Yakıt gideri başarıyla eklendi.

# fuelsAddWithError
source: Fuel expense could not be added. Try again later.
tr: Yakıt gideri eklenemedi. Daha sonra tekrar deneyin.

source: Vehicle Error
tr: Araç Hatası

# noVehicleError
source: You do not have a vehicle. Please add a vehicle from the My Vehicles section on the left menu.
tr: Aracınız yok. Lütfen sol menüdeki Araçlarım kısmından araç ekleyiniz.

# somethingWentWrong
source: Something went wrong. Please try again later.
tr: Birşeyler ters gitti.

source: Error
tr: Hata

# addFuelButtonTitle
source: Add Fuel
tr: Yakıt Ekle

# fotgotpw
source: Forgot Password
tr: Şifremi unuttum

# fotgotpwDesc
source: You can send an email to reset your password.
tr: Şifrenizi sıfırlamak için e-posta gönderebilirsiniz.

# validEmailAlert
source: Enter valid email address
tr: Geçerli bir mail adresi girin.

source: Email was sent
tr: Email gönderildi

# emailWasSentDecs
source: If your account was found, you will get a password reset link. Check your emails for the password reset link.
tr: Hesabınız bulunursa bir şifre sıfırlama bağlantısı alacaksınız. Şifre sıfırlama bağlantısı için e-postalarınızı kontrol edin.

# resetPwButtonTitle
source: Reset Password
tr: Şifremi Sıfırla

source: Login
tr: Giriş Yap

# loginDesc
source: You can log in with your email address.
tr: Email adresinizle giriş yapabilirsiniz.

source: Password
tr: Şifre

# enterPw
source: Enter Password
tr: Şifre girin

source: Login Error
tr: Giriş Hatası

# createAccountDesc
source: You can create an account with your email address.
tr: E-posta adresinizle bir hesap oluşturabilirsiniz.

source: Signup Error
tr: Üyelik Hatası

source: Add Vehicle
tr: Araç ekle

# firtVehicleDesc
source: You need to add one vehicle at least to track fuel expenses.
tr: Yakıt giderlerini takip etmek için en azından bir araç eklemeniz gerekiyor.

source: Selected Vehicle Type:
tr: Seçilen araç tipi:

source: Vehicle Name
tr: Araç ismi

# vehicleNameValid
source: Please give a name your vehicle like model, brand etc.
tr: Aracınıza bir isim verin. Model, marka gibi

source: Vehicle Id
tr: Araç plakası

# vehicleIdValid
source: Enter a unique id for your vehicle, like plate ID.
tr: Plaka gibi benzersiz bir numara giriniz.

source: Fuel Brand
tr: Yakıt Markası

# fuelBrandValid
source: Enter your preferred fuel brand.
tr: Tercih ettiğiniz yakıt markasınız giriniz.

source: Add Vehicle Error
tr: Araç Ekleme Hatası

source: Done
tr: Tamam

source: Edit Vehicle
tr: Araç Düzenle

source: Save
tr: Kaydet

source: Vehicle Details
tr: Araç Detayları

source: Fuel Count
tr: Yakıt Sayısı

source: Total Spent
tr: Toplam Harcama

source: Edit
tr: Düzenle

source: Delete Vehicle
tr: Aracı Sil

# deleteDesc
source: You can delete your vehicle with all expenses or just the vehicle.
tr: Aracınızı tüm yakıt masraflarınızla birlikte veya sadece kendisini silebilirsiniz.

source: Delete just vehicle
tr: Sadece aracı sil

source: Delete with expenses
tr: Yakıtlar ile birlikte sil

source: Cancel
tr: İptal

source: Delete
tr: Sil

# myVehicle
source: My Vehicles
tr: Araçlarım

# vehicleAddWithSuccess
source: Vehicle was successfully added.
tr: Araç başarıyla eklendi.

# vehicleAddWithError
source: Vehicle could not be added. Try again later.
tr: Araç eklenemedi. Daha sonra tekrar deneyin.

# vehicleDeleteWithSuccess
source: Vehicle was successfully deleted.
tr: Araç başarıyla silindi.

# vehicleDeleteWithError
source: Vehicle could not be deleted. Try again later.
tr: Araç silinemedi. Daha sonra tekrar deneyin.

# emptyVehicle
source: There is no vehicle here. You can add with add button on top bar
tr: Hiç aracınız yok. Sağ üstteki buton ile ekleyebilirsiniz.

source: Account
tr: Hesap

source: Delete Data
tr: Verileri Sil

# deleteDataDesc
source: Delete all vehicles and fuel expenses
tr: Yakıt harcamalarını ver araçları sil

# deleteDataConfirmation
source: This operation can not be returned. Are you sure?
tr: Bu işlem geri alnamayacaktır. Emin misiniz?

source: Yes, Delete
tr: Evet, Sil

source: Delete Account
tr: Hesabı Sil

# deleteWithAllData
source: Delete account with all data
tr: Hesabınızı tüm veriler ile birlikte sil

source: Export Data
tr: Dışa aktar

# enterNewEmailAdress
source: Enter new email address
tr: Yeni email adresi girin.

source: Email adress
tr: Email adresi

# exportDesc1
source: Your data will send to email address.
tr: Verileriniz email adresinize gönderilecek.

# exportDesc2
source: Fuel expenses will be .cvs file.
tr: Yakıt harcamalarınız csv dosyası olarak gönderilecek.

# exportDesc3
source: Receipt photos will be inside .zip file.
tr: Fiş/fatura fotoğrafları zip dosyası içinde gönderilecek.

# exportDesc4
source: These files are in email's attachments
tr: Doyaları gönderilen emailin eklentisinde bulabilirsiniz.

source: Success
tr: Başarılı

# exportConfirmation
source: Your data was sent successfully. Check your email.
tr: Verileriniz başarıyla gönderildi. Gelen kutunuzu kontrol edin.

# checkEmail
source: Check Email Adress
tr: Email adresinizi kontrol edin.

# checkEmailMessage1
source: Your entered email address is in an invalid format.
tr: Girdiğiniz email geçersiz bir formatta.

# checkEmailMessage2
source: The email address field can not be empty.
tr: Email alanı boş bırakılamaz.

source: Export
tr: Dışa aktar

source: Statistics
tr: İstatistikler

source: General
tr: Genel

source: Vehicle Count
tr: Araç Sayısı

# fuelExpense
source: Fuel Expense Count
tr: Yakıt Alışverişi Sayısı

# totalExpenseAmount
source: Total Expenses Amount
tr: Toplam Yakıt Harcaması

source: By vehicle
tr: Araca Göre

# fuelBrandInText
source: fuel brand:
tr: yakıt markası:

source: Total Expense
tr: Toplam Harcama

source: Add photo
tr: Fotoğraf Ekle

source: Select from gallery
tr: Galeriden Seç

# takePhoto
source: Take a photo
tr: Fotoğraf Çek

# receiptPhotoNotFound
source: Receipt photo was not found.
tr: Harcama fiş fotoğrafı bulunamadı.

# didNotAddReceiptPhoto
source: You did not add a receipt photo.
tr: Harcama fiş fotğrafı eklenmedi.

# continueWithoutPhoto
source: Continue without receipt photo.
tr: Fiş fotoğrafı eklemeden devam et

# turnBackReceipt
source: Turn back and add receipt photo
tr: Geri dön ve fotoğrafı ekle

# enterFuelExpense
source: Please enter fuel expense amount.
tr: Yakıt alışveriş tutarınızı girin.

# oneVehicleError
source: You have one vehicle to add fuel. If you want to add a new vehicle, go to 'My Vehicles' and add a vehicle.
tr: Yakıt ekleyebileceğiniz sadece bir aracınız var. Yeni bir araç eklemeyi için Araçlarım bölümünden yapabilirsiniz.

# goToVehicle
source: Go to My Vehicles
tr: Araçlarım'a Git

source: Receipt Photo
tr: Fiş/Fatura Fotoğrafı

source: Remove
tr: Kaldır

source: Fuel Details
tr: Yakıt Detayları

source: Vehicle
tr: Araç

# photoNotFound
source: Receipt photo was not found.
tr: Fiş/Fatura fotoğrafı bulunamadı.

source: Search Fuels
tr: Yakıt Ara

# searchHint
source: Search by vehicle name or id
tr: Araç ismine ya da id'ye göre ara

source: No fuel was found.
tr: Yakıt harcaması bulunamadı.

source: Select Vehicle
tr: Araç Seç

source: Logout
tr: Çıkış yap

source: App Version
tr: Versiyon

source: No Internet
tr: İnternet Yok

# noInternetDesc
source: Please check your internet connection.
tr: Lütfen internet bağlantınızı kontrol edin.

# invalidEmail
source: Your email address appears to be malformed.
tr: Email adresiniz geçersiz bir formatta.

# invalidLoginCredentials
source: Wrong password or email. Please check it and try again.
tr: Hatalı şifre ya da email adresiç Lütfen kotrol edip tekrar deneyin.

# userNotFound
source: User with this email doesn't exist.
tr: Bu email adresi ile kullanıcı bulunamadıç

# emailAlreadyExists
source: The email has already been registered. Please login or reset your password.
tr: Bu email adresi ile bir kullanıcı bulumakta. Giriş yapabilir ya da şifrenizi sıfırlayabilirsiniz.

# weakPassword
source: Your password is weak. It needs to be min 6 characters.
tr: Şifreniz zayıf. Minimum 6 karakter olarak tekrar giriniz.

# appleLoginErrorResult
source: Continue with Apple process could not be completed.
tr: Apple ile Devam et işlemi başarız oldu.

# googleLoginErrorResult
source: Continue with Google process could not be completed.
tr: Google ile Devam et işlemi başarız oldu.

# defaultResult
source: An undefined Error happened.
tr: Bir hata meydana geldi.

source: Car
tr: Araba

source: Motorcycle
tr: Motosiklet

source: Truck
tr: Ticari

source: Agriculture
tr: Tarım
